# Known Vocabulary Whitelist
#
# Words in this file will be skipped during vocab extraction.
# These are legitimate words that would otherwise be flagged as unknown.
#
# Categories:
# - British spellings
# - Latin terms common in scholarly texts
# - Common proper noun patterns
# - Historical/archaic English
# - Technical/scientific terms common in 19th century texts
#
# Format: one word per line, lowercase
# Lines starting with # are comments

# =============================================================================
# British Spellings (-ise/-isation vs -ize/-ization)
# =============================================================================
advertise
AdvertFORised
authorised
baptised
brutalised
capitalised
catalogued
categorised
centralised
characterised
christianised
civilisation
civilise
civilised
colonised
colour
coloured
colours
criticised
crystallised
customised
defence
despised
dialogues
digitised
dramatised
economised
emphasised
energised
equalised
evangelised
favour
favourable
favoured
fertilised
flavour
flavoured
formalised
galvanised
generalised
harbour
harmonised
honour
honourable
honoured
humour
humanised
hypnotised
idealised
idolised
immunised
industrialised
initialised
italicised
itemised
jeopardised
labour
labourer
laboured
legalised
legitimised
liberalised
localised
magnetised
materialised
maximised
mechanised
memorised
mesmerised
minimised
mobilised
modernised
monopolised
moralised
motorised
naturalised
neighbour
neighbourhood
neutralised
normalised
notarised
odour
optimised
organised
organised
ostracised
oxidised
paralysed
pasteurised
patronised
penalised
personalised
plagiarised
polarised
practised
pressurised
prioritised
privatised
publicised
pulverised
radicalised
randomised
rationalised
realised
recognised
reorganised
revolutionised
romanticised
rumour
rumoured
satirised
scandalised
scrutinised
sensitised
serialised
signalised
socialised
solemnised
specialised
standardised
sterilised
stigmatised
stylised
subsidised
summarised
supervised
symbolised
sympathised
synchronised
systematised
tantalised
terrorised
theorised
totalised
tranquillised
travelling
travelled
traveller
trivialised
tyrannised
unauthorised
uncivilised
unorganised
unrecognised
unsympathised
urbanised
utilised
vandalised
vaporised
verbalised
victimised
visualised
vocalised
vulgarised
weaponised
westernised

# =============================================================================
# Latin Terms (common in scholarly/legal/medical texts)
# =============================================================================
ab
ad
addendum
alma
alumnus
alumni
ante
apparatus
appendix
aqua
bona
circa
corpus
cum
curriculum
de
dictum
ergo
et
etc
ex
fide
ibid
idem
id
ie
in
infra
inter
ipso
jure
loco
magna
mater
modus
nisi
non
nota
opere
per
persona
post
prima
pro
qua
quod
re
sic
sine
status
sub
sui
supra
terra
ultra
vel
verbatim
versus
via
vice
vide
vita
viz

# Latin scholarly terms (common in academic/bibliographic texts)
foliis
filiis
operibus
rebus
libris
verbis
literis
annis
diebus
mensibus
ecclesiae
historiae
philosophiae
theologiae
bibliothecae

# =============================================================================
# Latin Phrases (as single words when hyphenated or joined)
# =============================================================================
defacto
dejure
exofficio
expost
habeas
ipsofacto
locum
mandamus
modus
opere
postmortem
priori
prorata
quorum
reus
subpoena
verbatim

# =============================================================================
# Greek-origin scholarly terms
# =============================================================================
aegis
aeon
aether
aesthete
aesthetic
aetiology
agora
aphorism
apotheosis
archetype
automaton
catharsis
chaos
chimera
cosmos
criterion
daemon
dogma
drama
ecstasy
enigma
ephemeral
epitome
ethos
euphoria
genesis
gnosis
hegemony
hubris
hypothesis
icon
logos
metamorphosis
miasma
nemesis
nous
oasis
odyssey
panacea
paradigm
paradox
pathos
phenomena
phenomenon
plethora
pneuma
praxis
psyche
schema
stigma
symposium
synthesis
telos
thesis
trauma

# =============================================================================
# French terms common in English texts
# =============================================================================
ancien
avant
beau
belle
blase
bourgeois
boutique
bureau
cabaret
cachet
cafe
carte
chic
clique
communique
connoisseur
corps
cortege
coup
couture
creche
critique
debut
decor
elite
ennui
ensemble
entente
entourage
entrepreneur
envoi
facade
fete
fiancee
fiance
foyer
frappe
fuselage
gaffe
gauche
genre
gourmet
habitue
laissez
lieu
lingerie
macabre
malaise
manoeuvre
matinee
melange
melee
menage
milieu
naive
naivete
niche
nuance
panache
papier
parole
passe
patois
penchant
petite
plateau
premiere
prestige
protege
provocateur
puree
rapport
regime
renaissance
rendezvous
repertoire
risque
role
rouge
sabotage
salon
savoir
silhouette
soiree
souffle
souvenir
tableau
technique
terrain
tete
touche
troupe
venue
vignette
vinaigrette
vogue
voyeur

# =============================================================================
# German terms common in English texts
# =============================================================================
angst
blitz
doppelganger
ersatz
fest
gestalt
hinterland
kaput
kindergarten
kitsch
leitmotif
poltergeist
realpolitik
schadenfreude
verboten
wanderlust
weltanschauung
wunderkind
zeitgeist

# German scholarly terms (common in academic/historical texts)
durchschnittlichen
handschriftlichen
landwirtschaftlichen
wirtschaftlichen
gesellschaftlichen
wissenschaftlichen
geschichtlichen
staatlichen
kirchlichen
bürgerlichen

# German names/titles (common in scholarly citations)
müller
mueller
könig
schmidt
schwarz
weiss
gross
klein
herrn
frau
fräulein
herr

# =============================================================================
# Historical/Archaic English
# =============================================================================
afoot
albeit
alms
anon
asunder
aught
aye
befell
beget
begot
begotten
beholden
behoof
behoove
behooved
beseech
besought
betide
betimes
betwixt
bidden
bight
billow
bodkin
bosom
brethren
brimstone
burnished
certes
chancel
chide
cleave
cometh
covet
dalliance
dearth
dost
doth
doughty
draught
ere
erstwhile
evermore
fain
farthing
fathom
fealty
fetter
fie
filial
firmament
forbear
forbore
forborne
forebear
foregone
foresaw
forfeit
forsake
forsaken
forsook
forsooth
forthwith
froward
gainsay
gird
girded
girt
goeth
goodly
hark
hast
hath
hence
henceforth
hereafter
herein
hereto
heretofore
herewith
hie
hither
hoary
howbeit
inasmuch
insomuch
joust
kindred
kith
knave
laud
lest
lief
liege
livery
lo
loth
maid
maiden
maidservant
maketh
malefactor
manifold
manservant
mayhap
meagre
mead
meeteth
methinks
mien
milord
mirth
monger
morrow
naught
nay
ne'er
nigh
nowise
oft
ofttimes
o'er
overture
palsy
palfrey
parley
parlour
patrimony
pauper
perchance
peril
perforce
pestilence
piety
pillory
pith
plenteous
portent
prattle
prithee
privation
privy
providence
provost
psalter
purveyor
quaff
quell
raiment
repast
reproach
requite
salve
scabbard
scourge
scrivener
sepulchre
shalt
shan't
shew
shewed
shewn
sirrah
smite
smote
smitten
sojourn
spake
squire
stalwart
stead
steward
strife
sunder
sundry
suppliant
surety
swain
tarry
thee
thence
thenceforth
thereabout
thereafter
thereby
therein
thereof
thereto
theretofore
thereupon
therewith
thine
thither
thou
thrall
thrice
thy
thyself
tidings
tis
'tis
'twas
twas
'twere
twere
'twould
twould
vouchsafe
wanton
wast
weal
wert
whence
whereabouts
whereas
whereat
whereby
wherefore
wherefrom
wherein
whereof
whereon
whereto
whereunto
whereupon
wherever
wherewith
whim
whilst
whither
whosoever
wilt
wist
withal
woe
woeful
wouldst
wraith
wrought
yea
yeoman
yore
yon
yonder

# =============================================================================
# Common Proper Noun Suffixes/Patterns (lowercase versions that appear)
# =============================================================================
# These help when proper nouns appear in lowercase context

# =============================================================================
# Medical/Scientific terms common in 19th century texts
# =============================================================================
abdomen
abscess
acetate
aetiology
albumen
alkaline
ammonia
anaemia
anaemic
anaesthesia
anaesthetic
aneurism
antiseptic
apoplexy
arsenical
asphyxia
atrophy
bacillus
bronchitis
calculus
calomel
carbolic
carbonate
catarrh
cauterize
chloride
chloroform
cholera
coagulate
congestion
contagion
convulsion
croup
cutaneous
cyst
decoction
delirium
diagnosis
diaphragm
diarrhoea
diphtheria
disinfectant
dissection
diuretic
dropsy
dysentery
dyspepsia
dyspnoea
effusion
emetic
emulsion
endemic
epidemic
epilepsy
erysipelas
excision
expectoration
faeces
febrile
fistula
fomentation
fracture
gangrene
gastric
gonorrhoea
gout
haemorrhage
hernia
homeopathic
hydrocephalus
hygiene
hypertrophy
hypochondria
hysteria
incision
inflammation
inoculation
intestinal
intoxication
iodine
jaundice
lancet
laryngitis
laudanum
lesion
ligation
liniment
lithotomy
livid
lumbago
malady
malaria
malignant
mania
membranous
meningitis
morbid
morphia
mucous
narcotic
nausea
neuralgia
nostrum
obstetric
ocular
oedema
ophthalmia
opium
osseous
palliative
palpitation
paralysis
paroxysm
pathology
peritoneum
peritonitis
pertussis
pessary
pharmacy
phlegm
phthisis
physic
plaster
plethora
pleurisy
pneumonia
poultice
prophylactic
prostration
puerperal
purgative
purulent
pustule
putrid
quarantine
quinine
rabies
rectum
resuscitation
rheumatism
rickets
salve
sciatica
scorbutic
scrofula
secretion
sedative
septic
serum
smallpox
spasm
spasmodic
sputum
stimulant
strangury
stricture
strychnia
strychnine
stupor
subcutaneous
suppuration
suture
symptom
syncope
syphilis
tetanus
therapeutics
thorax
thrombosis
tincture
tonic
tourniquet
trachea
tracheotomy
trauma
tubercle
tuberculosis
tumour
typhoid
typhus
ulcer
ulceration
urethra
uterus
vaccination
vaccine
variola
venereal
ventricle
vertigo
virulent
viscera

# =============================================================================
# Religious/Theological terms
# =============================================================================
absolution
advent
alleluia
amen
anathema
antichrist
apocalypse
apocrypha
apostasy
apostle
apostolic
archangel
ascension
atonement
baptism
beatitude
benediction
blasphemy
calvary
canticle
catechism
chancel
cherub
cherubim
christendom
communion
confessional
congregation
consecration
contrition
covenant
crucifixion
deacon
diocese
dispensation
divinity
doctrine
dogma
doxology
ecclesiastic
ecumenical
epistle
eschatology
eucharist
evangelical
evangelist
excommunicate
exodus
exorcism
expiation
gentile
gethsemane
glorification
gospel
grace
hallelujah
heathens
heresy
heretic
holiness
homily
hosanna
hymnal
idolatry
immaculate
incarnation
indulgence
iniquity
intercession
laity
lent
leviticus
litany
liturgy
manna
martyrdom
messiah
millennium
ministry
miracle
missionary
monastery
monastic
narthex
nativity
novitiate
ordination
orthodoxy
parable
parish
parson
paschal
patriarch
penance
pentecost
perdition
pharisee
piety
pilgrimage
pontifical
prayer
preach
predestination
prelate
presbytery
priest
primate
prophecy
prophet
propitiation
protestant
providence
psalm
psalter
purgatory
puritan
rabbi
rapture
redemption
reformation
regeneration
relic
repentance
resurrection
revelation
reverence
righteousness
sabbath
sacrament
sacrilege
saint
salvation
sanctification
sanctuary
scripture
sect
seminary
seraph
seraphim
sermon
shrine
simony
sinner
synod
tabernacle
testament
theology
tithe
transfiguration
transgression
trinity
unction
unitarian
universalist
vestment
vicar
vigil
vocation
worship

# =============================================================================
# Legal terms
# =============================================================================
abatement
abjure
abrogate
acquittal
adjudicate
affiant
affidavit
alienate
allegation
amicus
annul
appellant
appellee
appurtenance
arraign
arrears
assignee
assizes
attainder
attestation
bailiff
barrister
bequest
bequeath
certiorari
chattel
claimant
codicil
collateral
complainant
compurgation
conveyance
covenant
culpable
damages
decedent
decree
deed
defamation
defendant
demur
demurrer
deponent
deposition
devise
devisee
diligence
disclaim
docket
domicile
easement
eminent
enact
encumbrance
equity
escrow
estoppel
execution
executor
executrix
exonerate
extradition
fee
felon
felony
fiduciary
foreclosure
forfeiture
franchise
freehold
garnish
garnishment
grantor
grantee
guaranty
guardian
habendum
heir
heiress
hereditament
holograph
impanel
impeach
indemnify
indemnity
indenture
indictment
injunction
inquest
intestate
jurat
jurisprudence
juror
laches
lease
legacy
legatee
lessee
lessor
levy
liable
libel
lien
litigant
litigation
magistrate
malfeasance
mandamus
mandate
manslaughter
misdemeanor
mitigate
mortgage
mortgagee
mortgagor
movant
negligence
notary
novation
nuisance
obligee
obligor
ordinance
perjury
petition
plaintiff
plea
pleading
pledge
plenary
precedent
precept
premises
pretermit
primogeniture
probate
proctor
promissory
prosecute
prosecutor
proxy
quash
quitclaim
recognizance
recorder
recourse
redemption
referee
remand
remittitur
replevin
respondent
restitution
retainer
revoke
sanction
seizin
sequester
slander
solicitor
statute
stipulation
subpoena
summons
surety
tenancy
tenant
tenure
testament
testator
testatrix
testimony
tort
tortfeasor
tribunal
trustee
usury
vendee
vendor
venue
verdict
verification
vest
vested
waiver
warrant
warranty
writ

# =============================================================================
# Directory abbreviations (common in city directories)
# =============================================================================
# These are legitimate abbreviations, not OCR errors
bkkpr
bldr
blksmith
bricklyr
cabtmkr
carp
clk
confr
contr
coppersmith
drygds
dressmkr
engr
furn
grocer
harnessmkr
hsekpr
jewlr
lithogr
locksmith
machn
manuf
mcht
mfr
millnr
opr
paintr
photogr
physn
plasterer
plmbr
pres
printr
propr
salesm
secy
seamstrs
shoemkr
slsmn
stenogr
supt
tailor
tanner
teamstr
telegr
tinsmith
treas
uphol
watchmkr
whol

# =============================================================================
# Common abbreviations that may appear as "words"
# =============================================================================
esq
govt
hon
jr
ltd
messrs
mgr
mr
mrs
ms
sr
st

# =============================================================================
# Additional Medical/Scientific terms (from corpus analysis 2026-01-22)
# =============================================================================
# Medical terms common in 19th century texts not covered above
anchylosis
anchylosed
colocynth
crystallisation
crystallises
crystallizable
draughtsman
ecchymosis
ecchymoses
encyclopaedia
parenchyma
parenchymatous
symphysis
symptomatology

# German scholarly journal abbreviations
psychol
zeitschr
zeitschrift
wochenschr
wochenschrift
gesellsch
psychiat
ztschr
wchnschr

# =============================================================================
# Scottish/Irish/Welsh Surnames (Mc*, Mac*, O'*, etc.)
# =============================================================================
# Common prefixed surnames that appear in historical texts
mcallister
mcarthur
mcauley
mcbride
mccabe
mccall
mccarthy
mccarty
mcclellan
mcclelland
mcclure
mcconnell
mccormick
mccoy
mcculloch
mcdaniel
mcdonald
mcdonnell
mcdougall
mcdowell
mcfadden
mcfarland
mcgee
mcgill
mcgowan
mcgrath
mcgregor
mcguire
mchugh
mcintosh
mcintyre
mckay
mckee
mckenna
mckenzie
mckinley
mckinney
mckinnon
mclaughlin
mclean
mcleod
mcmahon
mcmanus
mcmaster
mcmillan
mcmurray
mcnair
mcnamara
mcneil
mcneill
mcpherson
macadam
macarthur
macaulay
macdonald
macdougall
macfarlane
macgregor
mackay
mackenzie
mackie
mackinnon
maclean
macleod
macmillan
macneil
macpherson
obrien
oconnell
oconnor
odonnell
oneill
osullivan

# British place name suffixes (appear in proper nouns)
derbyshire
perthshire
argyll
forsyth
smyth
smythe

# =============================================================================
# Medical/Scientific Terms (common in 19th-early 20th century texts)
# =============================================================================
dyspnoea
parenchyma
parenchymatous
symphysis
strychnia
colocynth
ecchymosis
anchylosis

# =============================================================================
# German Academic Abbreviations (common in scholarly references)
# =============================================================================
zeitschr
zeitschrift
wochenschr
ztschr
psychol
psychiat

# =============================================================================
# Additional Proper Names (historical figures, places)
# =============================================================================
mcclellan
mcdowell
macclean
maclean
humphry
bartsch
wyndham
conyngham
mcnaughton
gruffydd
gruffydh
wickliffe
radclyffe
redclyffe
mcduffie
mccaffrey
mccafferty
mcgiffert
banffshire

# =============================================================================
# Historical/Archaic Spellings
# =============================================================================
scythians
draughtsman
draughtsmen

# =============================================================================
# Latin Abbreviations (common in scholarly texts)
# =============================================================================
svo
lchdm
chauc
chrys
